spec/cassettes/StripeWrapper/Subscribe/when_credit_card_is_valid/returns_status_successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=7&card[exp_year]=2020&card[cvc]=123
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_4Nri8Z1od28KWtddi5FtBKkn
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Kenneths-MacBook-Air.local 13.2.0 Darwin Kernel Version 13.2.0: Thu Apr 17
        23:03:13 PDT 2014; root:xnu-2422.100.13~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Jul 2014 04:53:54 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '596'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-06-17'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_14ICKb4ScHo4kCbccZ8SZO3w",
          "livemode": false,
          "created": 1405832033,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_14ICKb4ScHo4kCbcDL03FoyI",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 7,
            "exp_year": 2020,
            "fingerprint": "Bs16CEwyEEcJyayY",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Sun, 20 Jul 2014 04:53:55 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_14ICKb4ScHo4kCbccZ8SZO3w&plan=regular&email=test%40test.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_4Nri8Z1od28KWtddi5FtBKkn
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Kenneths-MacBook-Air.local 13.2.0 Darwin Kernel Version 13.2.0: Thu Apr 17
        23:03:13 PDT 2014; root:xnu-2422.100.13~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '68'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 20 Jul 2014 04:53:55 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2220'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-06-17'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1405832034,
          "id": "cus_4R4TyXuKHlpYio",
          "livemode": false,
          "description": null,
          "email": "test@test.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4R4TyXuKHlpYio/subscriptions",
            "data": [
              {
                "id": "sub_4R4TyrPU8eg54N",
                "plan": {
                  "interval": "month",
                  "name": "Regular Subscription",
                  "created": 1405481985,
                  "amount": 2000,
                  "currency": "usd",
                  "id": "regular",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "object": "subscription",
                "start": 1405832034,
                "status": "active",
                "customer": "cus_4R4TyXuKHlpYio",
                "cancel_at_period_end": false,
                "current_period_start": 1405832034,
                "current_period_end": 1408510434,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4R4TyXuKHlpYio/cards",
            "data": [
              {
                "id": "card_14ICKb4ScHo4kCbcDL03FoyI",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 7,
                "exp_year": 2020,
                "fingerprint": "Bs16CEwyEEcJyayY",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4R4TyXuKHlpYio"
              }
            ]
          },
          "default_card": "card_14ICKb4ScHo4kCbcDL03FoyI"
        }
    http_version: 
  recorded_at: Sun, 20 Jul 2014 04:53:57 GMT
recorded_with: VCR 2.9.2
